[
  {
    "path": "posts/2025-02-19-first-post/",
    "title": "Trial Type, Response Time, and Error Rates",
    "description": "In this study, we are interested in testing a tradeoff pattern of stability/flexibility through a task-switching paradigm. Particularly we are interested in the interaction between pre-switch trials cue stimulus intervals (n-1 CSI’s) and no-switch/switch trials (NS/S).",
    "author": [
      {
        "name": "Sophia Angleton",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2025-02-19",
    "categories": [],
    "contents": "\r\nTrial Type and Response Time\r\nFirstly, I want to look at the interaction effects between switch trials, or when someone is switching from one task instruction to another, and no-switch trials, or when someone is doing one task repeatedly. I am doing this by looking at switch costs, represented through differences in response time.\r\n\r\n\r\n\r\nWe see that there is a difference in reaction time by trial types, where people tend to have a shorter reaction time in no-switch trials compared to switch trials. However, we see that there are two outliers, meaning that there are two subjects who had an unusually high mean response time in switch trials than others. This may contribute to skewing our switch trial mean response time to be longer than it should be. This is what we expect to see according to previous undersanding of trial type and reponse time.\r\nTrial Type and Error Rate\r\nSecondly, I want to look at the interaction effects between trial type and the error rate. I want to do this to account for a possible speed-accuracy tradeoff, where as you get faster in a task you may be less accurate. This is important to account for because it is not the tradeoff we are interested in testing and want to check that this is not the case.\r\n\r\n\r\n\r\nWe see that error rate does change from no-switch to switch trials, where no-switch trials seem to lead to lower average error rates by subject, and vice versa for switch trials. We see an outlier in the no-switch trial where one subject had unusually high error rates when completing no-switch trials which may be skewing the plot higher in overall error rate for the no-switch trial type. This is what we expect to see according to previous undersanding of trial type and error rate.\r\n\r\n\r\n\r\n",
    "preview": "posts/2025-02-19-first-post/first-post_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2025-02-26T19:05:38-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-02-19-second-post/",
    "title": "Interaction Plots",
    "description": "I am looking at the interactions between trial type, switch or no-switch, and our two main effect variables, the cue stimulus interval (CSI) of the trial or the congruency of the trial",
    "author": [
      {
        "name": "Sophia Angleton",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2025-02-19",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2025-02-19-second-post/second-post_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2025-03-04T14:09:58-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-02-19-third-post/",
    "title": "third-post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Sophia Angleton",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2025-02-19",
    "categories": [],
    "contents": "\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2025-02-19T16:23:27-08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Overview of Prepswitch",
    "description": "Main components of this project as outlined in the pre-registration. URL for pre-registion is linked to authors name.",
    "author": [
      {
        "name": "Sophia Angleton",
        "url": "https://doi.org/10.17605/OSF.IO/4DVGS"
      }
    ],
    "date": "2025-02-19",
    "categories": [],
    "contents": "\r\nIs it Harder to Switch away from Well-Prepared Tasks: Testing the Notion of a Stability-Flexibility Dilemma\r\nAbstract\r\nAccording to the stability/flexibility tradeoff, when one is performing a task that requires more cognitive stability, it is harder to be more cognitively flexible (Goschke, 2000). A recent reevaluation of the generalizability of the stability/flexibility tradeoff has posited that this negative relationship thought to occur with cognitive stability/flexibility may occur only in highly specified contexts (Mayr & Graetz, 2024). Instead, these authors argued for the possibility of an anti-tradeoff pattern, meaning there is a co-occurrence of cognitive stability and flexibility depending on the level of resolution encoding (Mayr et al., 2014).\r\nIn this study, we are interested in testing this tradeoff pattern of stability/flexibility through a task-switching paradigm. Particularly we are interested in the interaction between pre-switch trials cue stimulus intervals (n-1 CSI’s) and no-switch/switch trials (NS/S).\r\nHypothesis\r\nNull Hypothesis: Given the dominance of the stability-flexibility assumption, a credible Null-result of no interaction between N-1 CSI and the task-switch factor would be of interest.\r\nAlt Hypothesis: We predict there will be a directional relationship between task-switching and the cue stimulus interval. Directionality is informed through two main prediction models, the attractor landscape tradeoff model and the cognitive map anti-tradeoff model. We will measure both error rates and response time (RT) to inform our predictions, however between prediction models we are mainly interested in differences between response times and CSIs.\r\nN-1 CSI x NS/S\r\nH1 Stability/Flexibility Tradeoff “Landscape” Model: This hypothesis captures the prediction from the dominant tradeoff model. From that perspective, we would expect a negative directional relationship between the n-1 CSI and the task switch factor (NS/S) Specifically, we predict a significant interaction between n-1 CSI and No/S transitions, such that switch costs are larger when n-1 CSI was long than when it was short.\r\nH2 The Anti-Tradeoff “Cognitive Map” Model: Even more informative would be a positive directional relationship between n-1 task-switching and the n-1 CSI. Specifically, we predict a significant interaction between n-1 CSI and No/S transitions, such that switch costs are smaller when n-1 CSI was long than when it was short. We do not predict a significant difference in response time or error rate concerning task instruction order (size to parity, parity to size), only in task switch to no-switch order and its interaction with CSI latency.\r\nH3: In addition, we will explore the possible modifying role of trial N preparation (CSI). It is possible that the effect of N-1 CSI becomes apparent only when the trial N CSI is short (i.e., when there is little time for preparation). Thus, here we test for a N CSI x N-1 CSI * NS/S interaction, such that the pattern predicted for H2 is stronger when N CSI is long than when it is short.\r\nIn general, RT is our primary dependent variable. However, we will also examine error rates, to ensure that RT results are not qualified by tradeoff patterns (i.e., opposite direction of RT and error patterns).\r\nStudy Design\r\nFor our main predictions (H0, H1, and H2) we will use a 2x2 factorial within-subject design.\r\nParticipants\r\nSubjects will be recruited using the University of Oregon’s Human Subject Pool site. Participants are university students and will receive 1 course credit for their participation. This is a one-hour study conducted in-person and has no exclusion criteria. The target sample size is 30 subjects.\r\nTasks and Stimuli\r\nSubjects will see a box centered in the middle of a screen with a single digit number excluding 1, 5 and 0 in the box and one of two possible task instructions shown above the stimulus. There are two tasks, one task is either to determine if the number is larger than 5 or less than 5, denoted by instructions shown on the screen that says ‘Size’. The other task, called ‘Parity’ means that subjects will need to determine the parity of the number by instructions shown above the stimulus. In each block they will be given 15 seconds to complete as many of these trials as possible (max = 30 trials/block).\r\nProcedure\r\nParticipants will sign an informed consent form given by our lab, then will be instructed through the experiment ahead. They are told that in this study they will need to complete either a “Size” or “Parity” judgement of a number presented on the screen. There will be 150 blocks total, each block in a constant 15 second time limit. Where initiated trials are allowed to finish beyond the time limit. Upon learning the instructions, participants will complete two practice blocks, then proceed to the start of the experiment. After each block, they will receive feedback on trials completed, errors per block, correct responses, and accumulation of cents (3 correct responses = 1 cent). Cents are aggregated throughout trials which create incentive and retain task attention. After completion, they are asked to fill out two short lab surveys and will then be debriefed by the researcher and thanked for their time.\r\nDesign\r\nIn both tasks, size and parity, the instructions for this will be shown above the numerical stimulus in either a short (.0 sec) or long (.5 sec) CSI in which the subjects are not told about this manipulation. This means that when starting a new trial, depending on either the short or long CSI, the cue instructions size or parity are shown .0 or .5 seconds before the stimulus is presented and remain above the stimulus throughout that trial.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2025-02-26T19:19:07-08:00",
    "input_file": {}
  }
]
